export type Question = {
  q: string;
  image?: string;
  options: string[];
  correct: number;
};

export const QUESTIONS: Question[] = [
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image001.jpg",
    "options": [
      "右侧车道结束",
      "弯曲路在前",
      "单行道在前",
      "急弯路在前"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image002.jpg",
    "options": [
      "禁止驶入",
      "任何时候都必须停车",
      "让牌标识",
      "警告标识"
    ],
    "correct": 1
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image003.jpg",
    "options": [
      "任何时候都要停车",
      "前方慢行车辆",
      "限制路牌",
      "修路的标识"
    ],
    "correct": 1
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image004.png",
    "options": [
      "禁止右转",
      "禁止掉头",
      "禁止左转",
      "禁止直行"
    ],
    "correct": 2
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image005.jpg",
    "options": [
      "施工慢行，听从把旗帜的人指挥",
      "学校区在前",
      "凹凸路在前",
      "道路施工标志"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image006.jpg",
    "options": [
      "准许掉头或U转",
      "禁止掉头或U转",
      "限制直行",
      "交叉路口在前"
    ],
    "correct": 1
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image007.png",
    "options": [
      "前方修路工程",
      "前方道路终止",
      "禁止路牌",
      "前方有交通信号灯"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image008.jpg",
    "options": [
      "警告路牌",
      "火车路在前",
      "目的地指示牌",
      "医院标识"
    ],
    "correct": 2
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image009.jpg",
    "options": [
      "警告路牌",
      "小心行人过马路",
      "限制路牌",
      "不准超越"
    ],
    "correct": 2
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image010.png",
    "options": [
      "警告前方陡坡",
      "弯曲路在前",
      "行人斑马线在前",
      "前方有减速带或路面凹凸不平"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image011.png",
    "options": [
      "警告前方陡坡",
      "前方分叉路口",
      "前方铁路道口",
      "窄路在前"
    ],
    "correct": 2
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/913766103.jpg",
    "options": [
      "分叉公路开始",
      "分叉公路结束",
      "火车路在前",
      "单行公路在前"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image013.jpg",
    "options": [
      "此道不准右转",
      "此道只准右转",
      "此道可直行和右转",
      "让牌标识"
    ],
    "correct": 1
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image014.jpg",
    "options": [
      "准许泊车",
      "禁止驶入",
      "前方有停牌",
      "禁止停车"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image015.png",
    "options": [
      "最高时速50公里<30英里>",
      "最低时速为50公里",
      "保持时速50公里行驶",
      "此牌开始，限速为50公里/小时"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image016.png",
    "options": [
      "前方有停牌",
      "前方有火车路",
      "让有优先权的车辆先行",
      "前方有学校区"
    ],
    "correct": 2
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image017.png",
    "options": [
      "红色圈子表示允许标识",
      "停牌标识",
      "修路标识",
      "红色圈子表示禁止标识"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image018.png",
    "options": [
      "前方道路先转右再转左",
      "前方道路弯曲",
      "前方道路湿滑",
      "前方交叉路口"
    ],
    "correct": 1
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image019.png",
    "options": [
      "绿色圈子表示禁止标识",
      "停牌标识",
      "让牌标识",
      "绿色圈子表示准许标识"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image020.png",
    "options": [
      "学校区标识",
      "前方有游乐场所",
      "儿童玩耍区",
      "行人斑马线在前"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image021.png",
    "options": [
      "左转手势",
      "慢行手势",
      "停车手势",
      "慢行或停车的手势"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image022.jpg",
    "options": [
      "停牌标识",
      "让牌标识",
      "准许驶入",
      "禁止驶入"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image023.png",
    "options": [
      "急弯危险",
      "学校区标识",
      "靠右线行驶",
      "保持右线行驶"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image024.png",
    "options": [
      "我要左转",
      "我要慢行",
      "我要停车",
      "我要右转"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image025.png",
    "options": [
      "我要左转",
      "我要慢行",
      "我要右转",
      "车辆有故障"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image026.png",
    "options": [
      "右线终止",
      "路面变宽",
      "单程道在前",
      "路面变窄"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image027.png",
    "options": [
      "警告前方斜坡路",
      "前方修路工程",
      "小心路滑",
      "禁止大车行驶"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image028.jpg",
    "options": [
      "警告前方斜坡路",
      "急弯危险",
      "前方修路工程",
      "前面路湿时易打滑"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image029.jpg",
    "options": [
      "右线终止",
      "急弯危险",
      "前方火车路",
      "前方弯曲路"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image030.png",
    "options": [
      "右线准许右转和直行",
      "如果保持右线行驶必须右转",
      "右线为巴士专线",
      "右线准许左转"
    ],
    "correct": 1
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image031.jpg",
    "options": [
      "前方道路转右后转左",
      "急弯危险",
      "路面变窄",
      "路面湿滑"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image032.jpg",
    "options": [
      "前方有停牌",
      "前方有让牌",
      "前方有火车路",
      "前方有禁止路牌"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image033.png",
    "options": [
      "分叉公路开始",
      "右线终止",
      "分叉公路结束",
      "急弯危险"
    ],
    "correct": 2
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image034.png",
    "options": [
      "红灯时禁止右转",
      "红灯准许右转",
      "任何时候都不准右转",
      "不准超越"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image036.jpg",
    "options": [
      "准许超越/变道",
      "禁止超车/变道",
      "禁止停车",
      "让牌标识"
    ],
    "correct": 1
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image037.jpg",
    "options": [
      "前方窄路",
      "前方分叉路",
      "左转优先",
      "两边转左线"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image038.png",
    "options": [
      "前方有窄桥",
      "前方道路分叉",
      "右线终止",
      "两边转左线"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image039.png",
    "options": [
      "箭头方向有优先权",
      "前方火车路",
      "前方学校区",
      "前方道路分叉"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image040.png",
    "options": [
      "禁止货车出入",
      "遇到货车时减速",
      "前边道路右侧有货车出入",
      "货车专用车道"
    ],
    "correct": 2
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image041.jpg",
    "options": [
      "医院标识",
      "残疾人停泊车位",
      "禁止停车",
      "老年人专用车位"
    ],
    "correct": 1
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image042.png",
    "options": [
      "禁止停车标识",
      "医院标识",
      "残疾车辆标识",
      "新驾驶者标识"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image043.png",
    "options": [
      "与对面道路车辆共享道路",
      "分叉路在前",
      "弯曲路在前",
      "滑路在前"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image044.jpg",
    "options": [
      "特殊车辆在限制的时间内才能在该道路行驶（ 三人或以上以及巴士、的士、自行车）",
      "限制时间内不准停车",
      "该车道不允许巴士，的士，自行车及车辆上有三名乘客或以上在限制时间内行驶",
      "以上车辆及自行车除外，其他车辆禁止在该车道行驶"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image045.png",
    "options": [
      "动物园指示牌",
      "农场标识",
      "游乐场在前",
      "警戒鹿经常在此区出没"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image046.gif",
    "options": [
      "不准临时泊车",
      "不准泊车",
      "临时停车区",
      "货车卸货区"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image048.jpg",
    "options": [
      "红灯禁止右转",
      "前方有交通灯路口",
      "禁止标识",
      "提示十字路口安装红灯摄像机"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image049.jpg",
    "options": [
      "前方有十字路口",
      "右线终止",
      "不可停在交通路口堵塞交通",
      "提示该十字路口安放红灯摄像"
    ],
    "correct": 2
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image050.jpg",
    "options": [
      "不准超越（当学校巴士停牌伸出并闪着红灯）",
      "停牌在前",
      "学校区在前",
      "禁止停车标识"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image-049.png",
    "options": [
      "巴士专用道路",
      "限制车道（两人或以上者方可使用该车道）",
      "该车道为快车道",
      "紧急车辆专用道"
    ],
    "correct": 1
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image053.png",
    "options": [
      "前面可能有隐藏的巴士，小心慢驶并留意小童及闪红灯校巴",
      "前方有学校区",
      "前方有儿童玩耍区",
      "前方有修路工程"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image054.jpg",
    "options": [
      "不准停车的标识",
      "禁止临时停车",
      "货车停靠区",
      "停车时发动汽车不准超过1分钟"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image055.jpg",
    "options": [
      "黄灯闪烁时不准超过路牌限制速度行驶",
      "儿童玩耍区",
      "前方有游乐场",
      "前方弯曲路"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image056.png",
    "options": [
      "学校区在前.",
      "斑马线（人行道）30米/公尺内不准超越其他车辆/变道.",
      "禁止停车标志.",
      "停牌在前."
    ],
    "correct": 1
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image057.jpg",
    "options": [
      "靠环形路右驶出",
      "两边转左线",
      "修路工程在前",
      "货车停靠区"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image058.png",
    "options": [
      "交叉路口在前",
      "不准驶入",
      "停牌标志",
      "消防通道禁止泊车"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image059.gif",
    "options": [
      "前方有人行道（斑马线）",
      "停车时不准超越此线",
      "前方有交叉路口",
      "禁止驶入"
    ],
    "correct": 1
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image060.jpg",
    "options": [
      "公园指示牌",
      "弯曲路在前",
      "本社区邻里守望安全问题",
      "学校区标志"
    ],
    "correct": 2
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image061.png",
    "options": [
      "前方有交叉路口",
      "前方有修路工程",
      "前方道路不平",
      "交通违规举报"
    ],
    "correct": 3
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/image001.jpg",
    "options": [
      "右侧车道终止",
      "前方有隐蔽的十字路口",
      "你正驶向斜坡",
      "前方有人行横道"
    ],
    "correct": 0
  },
  {
    "q": "请选择正确的交通标志含义：",
    "image": "/g1-images/speedlimit-50-ahead%20(2).gif",
    "options": [
      "由此牌至下一路牌，最高时速每小时五十公里（三十哩）",
      "每小时限速五十公里（三十哩）",
      "前方时速每小时五十公里（三十哩）",
      "最低时速每小时五十公里（三十哩）"
    ],
    "correct": 2
  },
  {
    "q": "当驾驶执照被吊销，他/她…",
    "options": [
      "在有4年G牌人陪同下可以驾驶",
      "在紧急情况下可以驾驶",
      "在父母陪同下可以驾驶",
      "在任何情形下都不准驾驶"
    ],
    "correct": 3
  },
  {
    "q": "G牌驾驶者，初犯者被控酒后驾驶将立即停牌三天，酒精在血液中含量达到或超过多少？",
    "options": [
      "0%",
      "0.03%",
      "0.05%",
      "0.08%"
    ],
    "correct": 2
  },
  {
    "q": "以下哪种情况驾驶员的驾驶执照将被取消：",
    "options": [
      "持有伪造的驾照",
      "没有参加重考",
      "重考但不合格",
      "以上其中一项或全部"
    ],
    "correct": 3
  },
  {
    "q": "驾驶时需要证件齐全，警察有权要求驾驶员出示什么证件？",
    "options": [
      "车辆车主证（行车证）",
      "车辆保险单",
      "驾驶员有效的驾驶执照",
      "以上都是"
    ],
    "correct": 3
  },
  {
    "q": "驾驶员能否在以下情况下把驾照借给他人？",
    "options": [
      "在紧急情况下",
      "借给父母",
      "借给朋友",
      "永远不能"
    ],
    "correct": 3
  },
  {
    "q": "驾驶违规扣分达到9分，交通厅接见问话时，交通部将会暂停驾驶员的驾驶执照：",
    "options": [
      "驾驶员衣冠不整",
      "当驾驶员不能提出充分的理由来反对停牌",
      "迟到",
      "驾驶过失除非达到十五点，否则交通部是不能暂停执照的"
    ],
    "correct": 1
  },
  {
    "q": "驾驶员因违规扣分达15分或以上，驾驶执照将会吊销多少天 ？",
    "options": [
      "10天",
      "20天",
      "自动停牌，从退回驾照给交通部起停牌30天",
      "90天"
    ],
    "correct": 2
  },
  {
    "q": "G1（第一阶段）和G2（第二阶段）司机，第一次达到最高的过失点数，驾照将会被吊销多久？",
    "options": [
      "120天",
      "30天",
      "60天",
      "90天"
    ],
    "correct": 2
  },
  {
    "q": "第一阶段G1以及第二阶段G2司机，驾驶时酒精在血液中含量不能超过0.00%,超标者将有什么后果？",
    "options": [
      "驾照将被吊销",
      "驾照会被暂停30天，并将受到刑事犯罪的指控",
      "交通厅会给你一封警告信",
      "会被有关部门约见"
    ],
    "correct": 1
  },
  {
    "q": "第一阶段G1司机在什么时候可以在Don Valley pky,QEW，400系列等高速公路上驾驶？",
    "options": [
      "自己可以独立驾驶",
      "只能在白天驾驶",
      "只有在持牌驾驶导师陪同下",
      "没有特别规定"
    ],
    "correct": 2
  },
  {
    "q": "驾驶员因驾驶时使用手机等电子设备而发生交通意外：",
    "options": [
      "将停牌30天",
      "将重新路考",
      "将停牌90天",
      "将被控危险驾驶及扣6分"
    ],
    "correct": 3
  },
  {
    "q": "G1（第一阶段）驾驶员，驾驶时酒精在血液中的含量（酒精度）不能超过：",
    "options": [
      "0.00%",
      "0.03%",
      "0.05%",
      "0.08%"
    ],
    "correct": 0
  },
  {
    "q": "G2（第二阶段）驾驶员，驾驶时酒精在血液中的含量（酒精度）不能超过：",
    "options": [
      "0.00%",
      "0.03%",
      "0.05%",
      "0.08%"
    ],
    "correct": 0
  },
  {
    "q": "首次因被控违反交通法规驾照停牌者，除停牌外还需：",
    "options": [
      "罚款$1000元-$5000元",
      "罚款$3000元",
      "入狱6个月",
      "以上都是"
    ],
    "correct": 0
  },
  {
    "q": "警察有权要求你接受呼气测验及血液试验，如拒绝或呼气测验及血液试验结果超标，驾驶执照会立即吊销多少天？",
    "options": [
      "90天",
      "120天",
      "150天",
      "一年"
    ],
    "correct": 0
  },
  {
    "q": "第一阶段（G1）及第二阶段(G2)驾驶员，2年内违规扣点达到9分或以上，在停牌60天后过失分减至：",
    "options": [
      "2分",
      "3分",
      "4分",
      "6分"
    ],
    "correct": 2
  },
  {
    "q": "驾驶员因犯“刑事法”停牌期间. 被控再次驾驶或无证驾驶，车辆将扣押多少天？",
    "options": [
      "30天",
      "45天",
      "60天",
      "90天"
    ],
    "correct": 1
  },
  {
    "q": "当发生交通意外时，什么情况下一定要报警？",
    "options": [
      "损失超过$700",
      "损失过$1000",
      "有人受伤或死亡",
      "损失超过$2000 或有人受伤或死亡"
    ],
    "correct": 3
  },
  {
    "q": "未满20周岁的G2青年驾驶员，在取得G2牌照前6个月内，凌晨12时至5时驾驶可乘载：",
    "options": [
      "一位19岁或以下的青年乘客",
      "两位19岁或以下的青年乘客",
      "三位19岁或以下的青年乘客",
      "不能载有19岁或以下的青年乘客"
    ],
    "correct": 0
  },
  {
    "q": "未满20周岁的G2青年驾驶员，在取得G2牌照6个月后至考取G牌为止，凌晨12时至早上5时驾驶可乘载：",
    "options": [
      "一位19岁或以下的青年乘客",
      "两位19岁或以下的青年乘客",
      "三位19岁或以下的青年乘客",
      "不能载有19岁或以下的青年乘客"
    ],
    "correct": 2
  },
  {
    "q": "未满20周岁G2驾照青年驾驶者，前排乘客座位上有完全授权的驾驶员陪同下在凌晨12时至5时驾驶，可承载多名乘客：",
    "options": [
      "后排所有乘客都是驾驶员的直属亲戚",
      "所乘载的乘客不受年龄限制",
      "乘载的人数以不超过安全带的数量为准",
      "以上都是"
    ],
    "correct": 3
  },
  {
    "q": "如果首次因驾驶违规被判有刑事犯罪 ，你的驾照将至少暂停：",
    "options": [
      "一年",
      "两年",
      "三年",
      "四年"
    ],
    "correct": 0
  },
  {
    "q": "做为第一阶段G1司机，要想进入第二阶段G2，最关键要：",
    "options": [
      "参加驾驶员初级课程",
      "参加初级G2笔试",
      "路面练习",
      "在规定的时间内通过G2路考"
    ],
    "correct": 3
  },
  {
    "q": "行驶在双行线的公路上，听到紧急车辆警笛响时，法律上要求你应：",
    "options": [
      "尽快将车辆驶到公路的右边并停车",
      "将车辆减速至每小时20公里（10英里）",
      "加速行驶离开此处",
      "保持速度行驶."
    ],
    "correct": 0
  },
  {
    "q": "面对停牌标志（Stop牌），法律上你应该？",
    "options": [
      "减速慢行，在确认安全后再小心通过",
      "停车，在确认安全后在小心通过",
      "停车，然后前行",
      "给左右来往车辆让行"
    ],
    "correct": 1
  },
  {
    "q": "除非有速度限制标志，否则在城市内，市镇内，乡村内或发展区内最高的驾驶速度是：",
    "options": [
      "每小时40公里（25哩）",
      "每小时50公里（30哩）",
      "每小时60公里（35哩）",
      "每小时80公里（50哩）"
    ],
    "correct": 1
  },
  {
    "q": "直行通过十字路口，交通灯是红灯，你一定要：",
    "options": [
      "减速慢行，确认左右没有车辆，小心通过",
      "停车，确认左右没有车辆/行人，小心通过",
      "停车，直至信号灯转绿色并确认安全才通过",
      "停车，确认没有警察小心通过."
    ],
    "correct": 2
  },
  {
    "q": "在公路上驾驶者不准在其所拖的露营车或拖船上载有：",
    "options": [
      "人",
      "枪械/易燃易爆物品",
      "动物",
      "所有违禁品"
    ],
    "correct": 0
  },
  {
    "q": "双形道上转左，应行驶在哪条行车道？",
    "options": [
      "靠近分界线（黄线）右边行车",
      "靠近道路的右手边",
      "近道路的左手边",
      "都可以，只要发出左转信号就可以"
    ],
    "correct": 0
  },
  {
    "q": "路口亮绿灯时,以下谁最有优先通行：",
    "options": [
      "按照信号通行的行人",
      "不按照信号通行的行人",
      "向右转的车辆",
      "向左转的车辆"
    ],
    "correct": 0
  },
  {
    "q": "单行道上左转，车辆应行驶在那条车道？",
    "options": [
      "靠近公路的左手边",
      "靠近公路的右手边",
      "靠近公路的中线",
      "都可以"
    ],
    "correct": 0
  },
  {
    "q": "当有轨电车停下来并有乘客上下车时，必须停在离其后门至少多远的距离？",
    "options": [
      "2米",
      "12米",
      "40米",
      "150米"
    ],
    "correct": 0
  },
  {
    "q": "当你驶近十字路口而交通灯坏了，你应该：",
    "options": [
      "停车，等绿灯亮时再通过",
      "慢驶，让左右方向的车辆先行",
      "当四面停牌或听从警察指挥",
      "灯号坏了，当四面停牌处理."
    ],
    "correct": 2
  },
  {
    "q": "面对红灯允许转右时，法律上你应怎么做？",
    "options": [
      "完全停车，然后右转",
      "不停车而直接右转",
      "完全停车，红灯变绿灯后小心右转",
      "完全停车，确认安全后小心右转"
    ],
    "correct": 3
  },
  {
    "q": "安大略省安全带法例规定，行驶时乘客和司机必须系安全带：",
    "options": [
      "错误",
      "正确",
      "只需在市区驾驶时",
      "只需在高速公路驾驶时"
    ],
    "correct": 1
  },
  {
    "q": "两车同一时间到达一个没有管制标志的交叉路口时，哪一辆车有优先权？",
    "options": [
      "从右边驶来的车辆",
      "从左边驶来的车辆",
      "两者都不是",
      "直行车辆."
    ],
    "correct": 0
  },
  {
    "q": "法律上，低灯应在什么时候开启？",
    "options": [
      "在日落前半小时日出后半小时之间以及任何时间在150公尺（500呎）内看不清事物时",
      "在黄昏及黎明之间和在任何时间150公尺（500呎）内看不清楚时",
      "任何时候都不需要",
      "在日落前半小时，日出后半小时或任何时间在150公尺（500呎）内看不清事物时"
    ],
    "correct": 0
  },
  {
    "q": "司机是否要负责给车上所有乘客扣上安全带？",
    "options": [
      "只是负责乘客16岁以下",
      "只是负责乘客16岁以上",
      "只是负责乘客在前面的座位",
      "只是负责乘客在8岁以上"
    ],
    "correct": 0
  },
  {
    "q": "当跟在其他车辆后面多远距离需要将车头灯由高灯调整为低灯？",
    "options": [
      "20米（60呎）内",
      "60米（200呎）内",
      "100米（300呎）内",
      "120米（400尺）内"
    ],
    "correct": 1
  },
  {
    "q": "面对红灯并有绿色左转箭头，表示：",
    "options": [
      "小心向箭头方向行驶",
      "可以左转，但是要让行人，以及直行车辆",
      "行人优先",
      "停车，等待绿灯"
    ],
    "correct": 0
  },
  {
    "q": "交通事故涉及伤亡以及事故损失金额超过多少加元必须报警？",
    "options": [
      "$700",
      "$1000",
      "$2000",
      "$1200"
    ],
    "correct": 2
  },
  {
    "q": "闪烁绿灯，表示：",
    "options": [
      "安全时可以直行",
      "安全时可以左转",
      "安全时可以右转",
      "以上都可以."
    ],
    "correct": 3
  },
  {
    "q": "交通灯从绿灯变了黄灯，行人没有完全过完马路，以下谁有优先权？",
    "options": [
      "行人",
      "直行车辆",
      "左转车辆",
      "右转车辆"
    ],
    "correct": 0
  },
  {
    "q": "驾驶员被控酒后驾驶（酒精在血液中的含量为0.08%或以上），定罪处罚为停牌多久？",
    "options": [
      "30天",
      "60天",
      "90天",
      "3个月"
    ],
    "correct": 2
  },
  {
    "q": "车顶装有蓝色闪灯的车辆是？",
    "options": [
      "铲雪车辆",
      "救护车辆",
      "工程车辆",
      "紧急车辆"
    ],
    "correct": 0
  },
  {
    "q": "交通事故有人受伤时，一定要:",
    "options": [
      "只需与您的保险公司报告意外",
      "只需交换资料，自行到事故中心报案",
      "只需四十八小时内向省警或者市警报案即可",
      "立即致电911报案."
    ],
    "correct": 3
  },
  {
    "q": "驾驶在市区、乡镇、村庄以外的高速公路上应与商业车辆保持多少跟车距离？",
    "options": [
      "30米/公尺（100呎）",
      "60米/公尺（200呎）",
      "120米/公尺（400呎）",
      "150米/公尺（500呎）."
    ],
    "correct": 1
  },
  {
    "q": "驾驶者需要更改姓名或地址，法例上应在多少天内通知交通部？",
    "options": [
      "60天",
      "30天",
      "15天",
      "6天"
    ],
    "correct": 3
  },
  {
    "q": "驾驶员置身交通事故，如需报警，应在多久时间内报警？",
    "options": [
      "二十四小时内",
      "四十八小时内",
      "七十四小时内",
      "立刻"
    ],
    "correct": 3
  },
  {
    "q": "商业车辆在高速公路行驶出现故障时，应将照明器或反光器放置在车辆前后方多少距离？",
    "options": [
      "30公尺（100呎）",
      "60公尺（200呎）",
      "120公尺（400呎）",
      "150公尺（500呎）"
    ],
    "correct": 0
  },
  {
    "q": "以下什么情形下“U”转是危险和不合法的：",
    "options": [
      "在斜坡、弯道，双方向150米（500尺）视线不清",
      "在桥梁、隧道、高速公路",
      "在火车路上、火车路30米（100尺）内",
      "以上所有情形都包含."
    ],
    "correct": 3
  },
  {
    "q": "驾驶者在驾照停牌期间被控再次驾驶，会有什么后果？",
    "options": [
      "汽车将扣留至少45天",
      "罚款$1000-$5000元或入狱6个月或并罚",
      "停牌6个月",
      "以上全部都是"
    ],
    "correct": 3
  },
  {
    "q": "接近火车路时，电动式机械闪红灯或有工作人员挥动旗帜警告火车即将来临时，你应：",
    "options": [
      "加速，尽快驶过火车路",
      "停车，应与火车路轨保持至少5米（15尺）距离",
      "小心慢行通过",
      "停车，应与火车路轨保持10米（30尺）距离"
    ],
    "correct": 1
  },
  {
    "q": "在安省是有保险法的，车主如果没有为其车辆购买保险，有什么保障？",
    "options": [
      "5000元保险理赔",
      "10000元保险理赔",
      "20000元保险理赔",
      "得不到任何保险理赔"
    ],
    "correct": 3
  },
  {
    "q": "当你驶近十字路口，正亮红色交通灯，而警察打手势指挥你通过，你应：",
    "options": [
      "听从警察指挥，小心通过",
      "停车以确保警察确实要您穿越",
      "等待交通灯变绿",
      "示意警察注意红灯"
    ],
    "correct": 0
  },
  {
    "q": "超速50公里（30英里）或以上而收到警察告票，一旦定罪将有什么处罚？",
    "options": [
      "停牌30天（定罪后扣6分以及罚款）",
      "停牌3个月",
      "扣留汽车45天",
      "入狱3个月"
    ],
    "correct": 0
  },
  {
    "q": "当校巴停在中间没有安全岛的公路上，红灯闪烁并有学生上落，无论是迎面或后方车辆都应该：",
    "options": [
      "减速慢行，小心通过",
      "鸣笛，小心通过",
      "如果校巴在不同方向可以通过",
      "停在离校巴20米距离，直至校巴关闭车门、红灯不再闪烁，减速通过"
    ],
    "correct": 3
  },
  {
    "q": "驾驶员违规过失达到多少分可能会收到一封问话信或要求重新路考?",
    "options": [
      "3分",
      "6分",
      "9分",
      "15分"
    ],
    "correct": 2
  },
  {
    "q": "驾驶员因违规扣分达到15分，驾照停牌30天后，分数将：",
    "options": [
      "减至3分",
      "减至5分",
      "减至7分",
      "减至9分"
    ],
    "correct": 2
  },
  {
    "q": "汽车买卖交易时，卖方应该：",
    "options": [
      "提供“汽车安全合格证”",
      "在车主证卖方签字处签名",
      "提供签字后的车主证",
      "以上都是"
    ],
    "correct": 3
  },
  {
    "q": "行人过斑马线（人行道）时，车辆必须停车，你应：",
    "options": [
      "不准超越任何车辆，停车礼让行人",
      "鸣笛示意行人让车辆先行",
      "与行人擦肩而过",
      "熄火"
    ],
    "correct": 0
  },
  {
    "q": "公路上黄色虚线表示：",
    "options": [
      "安全时可以变道（超越）",
      "不可超越",
      "随时可以超越（变道）",
      "晚间才可以超越（变道）"
    ],
    "correct": 0
  },
  {
    "q": "当你决定“U转”与否之前，应该先查看：",
    "options": [
      "是否有警察？",
      "周围是否有车辆？",
      "是否在路口附近",
      "交通规则"
    ],
    "correct": 3
  },
  {
    "q": "地下的线有黄色虚线和实线组合，实线一方表示：",
    "options": [
      "超越、换道是合法的",
      "超越、换道是不合法的",
      "鸣笛后可以超越、变道",
      "没有特别规定"
    ],
    "correct": 1
  },
  {
    "q": "当电车停靠在有安全岛的车站让乘客上落车时，车辆应该：",
    "options": [
      "停在安全岛后最少3公尺",
      "加速通过",
      "鸣笛小心通过",
      "慢速通过"
    ],
    "correct": 3
  },
  {
    "q": "当驶入一个交通信号灯不工作及无人指挥交通的交叉路口，你应该：",
    "options": [
      "停车，然后通过",
      "只有在其他车辆接近时才停车",
      "在通过交叉路口前，注意观察左右并再一次观察左方以确认安全",
      "参照四面停牌的做法，谨慎通过交叉路口."
    ],
    "correct": 3
  },
  {
    "q": "当校巴停下、上落乘客，驾驶员没有按规定停车,将受到什么处罚？",
    "options": [
      "扣6分再加罚款$1000以上",
      "扣9分再加罚款$2000以上",
      "重新路考",
      "停牌30天"
    ],
    "correct": 0
  },
  {
    "q": "驾驶违规由定罪日起（法庭判决日），违规加分记录将保留：",
    "options": [
      "1年",
      "2年",
      "3年",
      "5年"
    ],
    "correct": 1
  },
  {
    "q": "在安省，驾驶时可以使用手机接听电话吗？",
    "options": [
      "可以随便拨打和接听电话",
      "可以发信息",
      "可以上网查找资料",
      "除了拨打911外，不可以用手握住手机拨打和接听."
    ],
    "correct": 3
  },
  {
    "q": "安省新例规定，作为G驾驶员，驾驶时酒精在血液中的含量（酒精度）应不超过0.05%,未满21周岁G牌青年驾驶员，驾驶时酒精在血液中的含量（酒精度）必须不能超过：",
    "options": [
      "0%",
      "0.03%",
      "0.05%",
      "0.08%"
    ],
    "correct": 0
  },
  {
    "q": "第一阶段司机（G1）不允许独立驾驶，陪同者的酒精在血液中的含量应低于：",
    "options": [
      "0%",
      "0.03%",
      "0.05%",
      "0.08%"
    ],
    "correct": 2
  },
  {
    "q": "左转时，你的车辆已经在交叉路口中等待， 交通信号灯由黄灯变红灯时，你应该：",
    "options": [
      "因为信号灯已经变红灯，要在原处等待",
      "确认安全后转弯",
      "倒后退出交叉路口",
      "直行通过交叉路口，因为此时比左转更加安全"
    ],
    "correct": 1
  },
  {
    "q": "道路中间画着实线和虚线，而你靠近实线一边，表示什么？",
    "options": [
      "安全时可以变道",
      "禁止变道",
      "可以超速",
      "没有特殊意义"
    ],
    "correct": 1
  },
  {
    "q": "如果错过了高速公路的出口，你应该怎么做？",
    "options": [
      "下一个出口再出去",
      "马上调头",
      "停车",
      "急刹车"
    ],
    "correct": 0
  },
  {
    "q": "当你达到一个十字路口时，交通灯正闪烁绿灯，意味什么？",
    "options": [
      "你可以直行",
      "你可以左转",
      "你可以右转",
      "以上都是"
    ],
    "correct": 3
  },
  {
    "q": "当两辆车同时达到一个没有信号灯或停牌管制的路口，以下哪辆车辆有优先权？",
    "options": [
      "左手边来的车辆",
      "右手边来的车辆",
      "没有规定，就看谁谦让",
      "速度快的车辆"
    ],
    "correct": 1
  },
  {
    "q": "下列哪一种情境下进行 U 型转弯是危险和违法的？",
    "options": [
      "车辆位于弯路或坡道上，前后两个方向150m内无法瞭望到有无过往车辆",
      "车辆位于铁道上，或距离铁道不足30m",
      "车辆位于桥梁，高速公路或隧道中，且前后两个方向150m内无法瞭望到有无过往车辆",
      "以上都是"
    ],
    "correct": 3
  },
  {
    "q": "当你把车驶出停车位前，你应？",
    "options": [
      "查看周围的交通状况，打转向灯后立即驶离路边",
      "先按喇叭，然后慢慢驶离路边",
      "查看周围的交通状况，打转向灯，当安全时驶出",
      "打转向灯，然后立即驶离路边"
    ],
    "correct": 2
  },
  {
    "q": "当校巴通过铁路的道口前，法例上需要怎么做？",
    "options": [
      "停车，无论此时路口有无信号灯闪烁或护栏阻挡",
      "仅在车上有学生时需要停车",
      "无需停车",
      "仅在车上的座位有一半是空闲时才需要停车"
    ],
    "correct": 0
  },
  {
    "q": "跟在其他车辆后面行驶时，什么情况下不能使用远光灯？",
    "options": [
      "与前车距离小于30米时",
      "与前车距离小于60米时",
      "与前车距离小于120米时",
      "与前车距离小于150米时"
    ],
    "correct": 1
  },
  {
    "q": "驾驶时刹车失灵了怎么办？",
    "options": [
      "如是手动档车辆，切换到低档以减速",
      "缓慢但用力踩下刹车踏板",
      "反复踩刹车踏板",
      "所有选项均正确"
    ],
    "correct": 3
  },
  {
    "q": "变道超车通常都是从左边的快车道完成，法例是否允许从右车道超车呢？",
    "options": [
      "允许，任何情况下都可以",
      "允许，只要对自己的车技有信心",
      "不行，任何情况下都禁止这样做",
      "允许，前提是在同一方向上有2条以上的车道"
    ],
    "correct": 3
  },
  {
    "q": "当准备 U 形转弯之前，应该确认什么？",
    "options": [
      "是否允许 U 形转弯",
      "有没有树木、路灯或消防栓",
      "自己车辆的转弯半径",
      "路面是否湿滑"
    ],
    "correct": 0
  },
  {
    "q": "发生车祸后，下列中的哪一件事是不应该做的？",
    "options": [
      "找个地方喝点东西冷静一下，准备和警察谈话",
      "关闭发动机并且打开双闪灯以警示路过的其它车辆",
      "禁止任何人在现场吸烟或使用明火，以免引燃可能泄露出来的燃料",
      "如果你学过急救，在自己所掌握的知识范围内尝试处置伤员"
    ],
    "correct": 0
  },
  {
    "q": "倒车时，你应该怎么做？",
    "options": [
      "通过两边侧镜观察",
      "通过中间倒后镜观察",
      "不断转身360度观察",
      "以上都需要"
    ],
    "correct": 3
  },
  {
    "q": "汽车买卖，作为原车主，你有哪些责任？",
    "options": [
      "在卖车后的6天之内，通知安省服务中心更改车主姓名",
      "提供签字后的车主证",
      "提供车辆安全证书",
      "以上答案都正确"
    ],
    "correct": 3
  },
  {
    "q": "如未按照法律规定使用儿童座椅，将被罚款多少元？",
    "options": [
      "最高$1000罚款并扣2分",
      "最高$1500罚款并扣4分",
      "不会被罚款",
      "不会被罚款，只会被扣3分"
    ],
    "correct": 0
  },
  {
    "q": "酒精和药物会影响一名司机的什么？",
    "options": [
      "视觉",
      "判断力",
      "反应速度",
      "以上全部"
    ],
    "correct": 3
  },
  {
    "q": "在大雾中行驶时，应使用？",
    "options": [
      "停车灯",
      "近光灯",
      "停车灯和远光灯",
      "远光灯"
    ],
    "correct": 1
  },
  {
    "q": "除了“免提设备”外，驾驶时法例规定驾驶员双手禁止接触手机等电子产品，以下哪些算“免提设备”？",
    "options": [
      "配有耳机或声控拨号装置的手机",
      "车载 GPS 导航设备，或者非车载 GPS 但是固定在车内的某个位置",
      "便携式音乐播放器（比如 MP3），但是已经与车内音响系统相连接，且已经设定好了歌曲目录",
      "以上全部"
    ],
    "correct": 3
  },
  {
    "q": "当你达到十字路口，有一盏黄灯在闪烁（如图），法例上要求你：",
    "image": "/g1-images/fyl.png",
    "options": [
      "停车，安全后再前行",
      "停车，等待绿灯后前行",
      "减速慢行，小心通过",
      "快速通过"
    ],
    "correct": 2
  },
  {
    "q": "当你达到一个十字路口，有一盏闪烁的红灯（如图），法例上要求你应该：",
    "image": "/g1-images/rd.png",
    "options": [
      "停车，确定安全后小心通过",
      "停车，等待绿灯亮后小心通过",
      "减速慢行，小心通过",
      "没有特殊意义"
    ],
    "correct": 0
  },
  {
    "q": "当你到达一个绿灯闪烁的十字路口时（如图），你有优先权（此时行人没有优先权），可以：",
    "image": "/g1-images/frel.png",
    "options": [
      "左转",
      "右转",
      "直行",
      "以上全部"
    ],
    "correct": 3
  },
  {
    "q": "在高速公路驾驶时，应与摩托车保留一个安全的空间，这是因为：",
    "options": [
      "摩托车体积小，速度快，经常在车辆盲区内",
      "摩托车司机喜欢飙车",
      "摩托车声音大",
      "摩托车速度慢"
    ],
    "correct": 0
  },
  {
    "q": "当车辆需要“U”转时，首先需要观察是否有禁止“U”转的限制牌，同时必须：",
    "options": [
      "前方150米内视线清晰时才可以进行",
      "前方100米内视线清晰时才可以进行",
      "前方50米内视线清晰时才可以进行",
      "前方30米内视线清晰时才可以进行"
    ],
    "correct": 0
  },
  {
    "q": "驾驶时，当接近自行车时，车辆应与自行车保持至少多少米的安全距离？",
    "options": [
      "1米",
      "3米",
      "5米",
      "没有特别规定"
    ],
    "correct": 0
  },
  {
    "q": "第一阶段G1或第二阶段G2司机，驾驶时血液里的酒精含量最高是多少？",
    "options": [
      "0.5%",
      "0.08%",
      "0.05%",
      "0.0%"
    ],
    "correct": 3
  },
  {
    "q": "除非你在原居地驾照的驾龄（至少2年）全部被认可，否则通过G2后需要等候多久才能参加G路考？",
    "options": [
      "8个月",
      "1年",
      "2年",
      "随时可以参加考试"
    ],
    "correct": 1
  },
  {
    "q": "第二G2司机，驾驶时酒精在血液中的含量是0.00%，除此之外可以：",
    "options": [
      "在任何时间，任何公路上驾驶",
      "乘客的数量不允许超过安全带的数量",
      "12个月后参加G2-G路考，合格后才能获得全面驾驶执照G牌",
      "以上都是"
    ],
    "correct": 3
  },
  {
    "q": "陡坡停车时（下坡），为避免车辆溜车，应该：",
    "options": [
      "仅设置泊车制动",
      "将前轮与路沿保持平行",
      "将前轮转左并仅设置泊车制动",
      "将前轮转右并且设置泊车制动"
    ],
    "correct": 3
  },
  {
    "q": "当驶进让牌的交叉路口时，应该：",
    "options": [
      "保持同样的车速并且左右查看",
      "停止，然后快速进入交叉路口",
      "减速，如有需要时停车及让有优先权者先",
      "停止，然后慢慢地进入交叉路口"
    ],
    "correct": 2
  },
  {
    "q": "新的安省居民要在多少天内登记他们的车辆？",
    "options": [
      "30天",
      "60天",
      "90天",
      "120天"
    ],
    "correct": 0
  },
  {
    "q": "在改变了你的车辆颜色后，你应该做什么？",
    "options": [
      "6天内报告给安省服务中心",
      "60天内报告给安省服务中心",
      "90天内报告给安省服务中心",
      "不需要做任何事情"
    ],
    "correct": 0
  },
  {
    "q": "警察有权要求车主拿出什么文件？",
    "options": [
      "保险单",
      "车主证",
      "驾驶执照",
      "以上任何一项"
    ],
    "correct": 3
  },
  {
    "q": "环岛上什么车辆有优先行驶权？",
    "options": [
      "驶入环岛的车辆",
      "在环岛中行驶的车辆",
      "在环岛中右转的车辆",
      "在环岛中左转的车辆"
    ],
    "correct": 1
  },
  {
    "q": "当你到达一个闪烁黄灯的交叉路口时，你应该：",
    "options": [
      "停车，等待绿灯再行驶",
      "保持匀速前进",
      "停车，让左右方向的车辆",
      "慢行，通过要加倍小心."
    ],
    "correct": 3
  },
  {
    "q": "晚间驾驶时在什么情形下需要开低灯？",
    "options": [
      "与前方车辆车距30米（100尺）内",
      "与前方车辆车距120米（400尺）内",
      "与前方车辆车距150米（500尺）内",
      "都可以。"
    ],
    "correct": 2
  },
  {
    "q": "车辆驾驶进入高速公路前，你应该：",
    "options": [
      "发出信号并加速达到高速公路的速度，然后驶入高速交通中",
      "打信号灯加速后停在加速线上，看准有安全的位置尽快驶入高速公路",
      "加速，只要有位置就可以驶入高速交通中",
      "慢行，等待高速公路上的车辆减速后驶入高速交通 。"
    ],
    "correct": 0
  },
  {
    "q": "右转时，驾驶员应行驶在道路的哪一个车道？",
    "options": [
      "靠近公路的最右边",
      "靠近公路的左边",
      "靠近公路的中线",
      "都可以"
    ],
    "correct": 0
  },
  {
    "q": "直通过交通灯十字路口，绿灯刚转黄灯，你应怎么做？",
    "options": [
      "加速前进，尽快通过十字路口；",
      "停车，如果停车是危险的，前进要小心",
      "如果车辆车头在停车线内需要停车",
      "如果车辆车头已超越停车线就加速前进 ."
    ],
    "correct": 1
  },
  {
    "q": "在安全的情形下，可从别的车辆右方超越:",
    "options": [
      "只能在三条车道的公路上才可以",
      "只要发出信号都准许",
      "无论在什么情况下都不准许",
      "行驶在同一方向有两条或以上的车道上是准许的."
    ],
    "correct": 3
  },
  {
    "q": "交叉路口，并有让牌标志面对时，你怎么做？",
    "options": [
      "保持同样的速度，注意观察左右情况",
      "停车，然后缓慢进入交叉路口",
      "停车，然后加速进入交叉路口",
      "慢行，如有需要时停车及让有优先权车辆先行."
    ],
    "correct": 3
  },
  {
    "q": "当接近交叉路口，发现路口交通堵塞，你应该：",
    "options": [
      "停在交叉路口前，前方交通顺畅时再通过",
      "与前方车辆保持一个车位即可",
      "紧贴前方的车辆行驶",
      "鸣笛，提醒前方车辆加速前进"
    ],
    "correct": 0
  },
  {
    "q": "驾驶时应与前方车辆保持多少车距，无论在任何情况下，你都可以安全停车？",
    "options": [
      "60米（200尺）",
      "90米（300尺）",
      "3个车位",
      "在一个安全距离距离内"
    ],
    "correct": 3
  },
  {
    "q": "改变车道（变线）前，必须：",
    "options": [
      "仅看倒后镜",
      "减速，打出正确的信号",
      "鸣笛，观察后方车辆",
      "发出正确信号灯、观察、确定安全后才可以."
    ],
    "correct": 3
  },
  {
    "q": "法例上规定泊车时应该距离消防栓（救火喉）多少距离？",
    "options": [
      "1.5米/公尺（5尺）",
      "3米/公尺（10尺）",
      "6米/公尺（20尺）",
      "都可以"
    ],
    "correct": 1
  },
  {
    "q": "驾驶时最易导致汽车轮胎打滑原因是什么？",
    "options": [
      "机械问题",
      "轮胎气压问题",
      "路面有水、冰雪",
      "驾驶速度太快"
    ],
    "correct": 3
  },
  {
    "q": "在什么时候可以使用泊车灯？",
    "options": [
      "在泊车时",
      "仅在在道路畅通并无其他车辆情况下",
      "行驶在照明好的街道上",
      "在任何时候"
    ],
    "correct": 0
  },
  {
    "q": "在湿滑、雪地、结冰的公路上快速停车的最佳方法是：",
    "options": [
      "猛踩脚刹，直至车辆停止",
      "松油门直至车辆停止",
      "踩脚刹，用一踩一松的方法，直至车辆停止",
      "与平时方法一样."
    ],
    "correct": 2
  },
  {
    "q": "车辆在雾天行驶，你应使用：",
    "options": [
      "高灯",
      "泊车灯",
      "低灯",
      "都可以"
    ],
    "correct": 2
  },
  {
    "q": "当车辆泊在向下的斜坡时，为防止汽车滑向交通中，驾驶员应：",
    "options": [
      "方向盘往右打、扭前轮向右，并拉紧收刹",
      "方向盘往左打、扭前轮向左，并拉紧收刹",
      "无需打方向盘，拉手刹即可",
      "没有特别要求"
    ],
    "correct": 0
  },
  {
    "q": "当别的车辆要超越你的车辆时，应该：",
    "options": [
      "加速，示意超越时不必要的",
      "将车辆驶向左边，阻止超越",
      "向其驾驶员打出信号示意不要超越",
      "开车至右边行驶，并让其超越."
    ],
    "correct": 3
  },
  {
    "q": "驾驶时当车辆驶入泥地，最安全方法是:",
    "options": [
      "急刹车，让车辆停止",
      "踩刹，急打方向盘，驶回路面",
      "鸣笛，减速，靠边停车",
      "驾驶员应把脚离开油门，让车辆自然减速后再驶回公路."
    ],
    "correct": 3
  },
  {
    "q": "当你以每小时50公里的速度行驶，应与前方车辆保持多少车距？",
    "options": [
      "一个车位",
      "三个车位",
      "五个车位",
      "七个车位"
    ],
    "correct": 1
  },
  {
    "q": "在郊外行驶（城市外，乡村，发展区以外），如无速度指示牌，最高时速应该是：",
    "options": [
      "50公路/小时",
      "60公里/小时",
      "80公里/小时",
      "100公里/小时"
    ],
    "correct": 2
  },
  {
    "q": "车辆从停车位驶入路面，你应该：",
    "options": [
      "打信号灯就可以了，后天的车辆要让前方的车辆",
      "不用礼让后方车辆，因为不在同一条道路",
      "打信号灯，鸣笛就可以驶入路面",
      "看清楚交通情况，打信号灯，当安全时驶入交通."
    ],
    "correct": 3
  },
  {
    "q": "当你行驶在向下陡坡时, 最安全的驾驶方法是:",
    "options": [
      "用空档行驶",
      "紧握方向盘",
      "熄火",
      "用低档行驶或用制动让车辆减速"
    ],
    "correct": 3
  },
  {
    "q": "晚间驾驶时，你必须用低灯，当你：",
    "options": [
      "迎面车辆的车头灯使你看不清路面情况时",
      "贴近前方车辆或遇到迎面来车时",
      "贴近前方车辆时",
      "通过路口时"
    ],
    "correct": 1
  },
  {
    "q": "晚间驾驶比日间更为危险，因为：",
    "options": [
      "晚间驾驶反应慢",
      "晚间驾驶路面车辆多",
      "晚间路面行人多",
      "晚间驾驶视线没有白天好，你不能看到前方很远."
    ],
    "correct": 3
  },
  {
    "q": "晚间驾驶，迎面车辆使用高灯，无法看清路面情况，你应该：",
    "options": [
      "把视线离开对方车辆，并稍微移向右边",
      "开高灯",
      "鸣笛提醒迎面车辆开低灯",
      "眼睛直视前方"
    ],
    "correct": 0
  },
  {
    "q": "除非你想超越其他车辆或左转，否则你应：",
    "options": [
      "保持左线行驶",
      "保持中线行驶",
      "保持右线行驶",
      "都可以"
    ],
    "correct": 2
  },
  {
    "q": "车辆由私家路或自家车道驶入公路之前，应该：",
    "options": [
      "尽可能快速进入或通过公路",
      "打手势，然后优先通行",
      "让公路上所有优先权的车辆或行人先行",
      "鸣笛、小心前进"
    ],
    "correct": 2
  },
  {
    "q": "车辆爆胎的正确处理方法:",
    "options": [
      "松油门，减速",
      "控制好方向盘",
      "打右灯、靠右停车",
      "以上全部都是"
    ],
    "correct": 3
  },
  {
    "q": "雪天和雨天驾驶很容易轮胎打滑，当打滑时，最好的方法是：",
    "options": [
      "急刹减速",
      "方向盘往相反方向大力转",
      "紧握方向盘",
      "把方向盘转向滑车方向"
    ],
    "correct": 3
  },
  {
    "q": "车辆失控并驶出路边，最佳处理方法是：",
    "options": [
      "紧握方向盘",
      "脚松开油门、减速，不可急刹",
      "当车辆速度得以控制，重新驶入公路",
      "以上全部都是"
    ],
    "correct": 3
  },
  {
    "q": "407高速公路是：",
    "options": [
      "车速最快的高速公路",
      "道路最畅通的高速公路",
      "特殊车辆行驶的高速公路",
      "快速、收费的高速公路."
    ],
    "correct": 3
  },
  {
    "q": "雪胎最好在什么季节使用 ？",
    "options": [
      "四季都可以",
      "冬季",
      "春季",
      "夏天"
    ],
    "correct": 1
  },
  {
    "q": "驾驶时，车辆脚刹失控，你应：",
    "options": [
      "脚一踏一放方法制刹",
      "拉紧手刹",
      "手按住手刹的按钮",
      "以上全部都是"
    ],
    "correct": 3
  },
  {
    "q": "驾驶时应与前方车辆保持一个安全车距，如果后方车辆与你的车辆跟车距离太近，你应：",
    "options": [
      "如果有可能应保持其他车道行驶，让其超越",
      "轻微减速，切忌急刹车",
      "与前方车辆保持一个安全距离，避免因前方车辆急刹车而被后方车辆追尾",
      "以上都是"
    ],
    "correct": 3
  },
  {
    "q": "左右转或变道以及改变方向时一定要观察盲点，因为：",
    "options": [
      "路考需要，平时驾驶不需要观察盲点",
      "这是北美驾驶的习惯",
      "无论你怎么调整镜子都存在盲点",
      "以上都是"
    ],
    "correct": 2
  },
  {
    "q": "晚间驾驶驾驶员视线不清，速度太快很容易引起交通意外，因为：",
    "options": [
      "驾驶员容易疲倦",
      "驾驶员注意力容易分散",
      "视线不清，车头灯所看到的距离有限，如果速度过快看到危险时已无法有效停车",
      "对方车辆车头灯光刺眼"
    ],
    "correct": 2
  },
  {
    "q": "驾驶时，如你想超越摩托车或自行车，你应该：",
    "options": [
      "在超车前鸣笛",
      "在超车前打开高灯",
      "发出信号，安全时从左道超越，方法与超越车辆一样",
      "用摩托车一半的行车线超车"
    ],
    "correct": 2
  },
  {
    "q": "在驾驶途中遇到车胎突然爆胎，你应该：",
    "options": [
      "把好方向盘",
      "脚离开油门使车减慢",
      "靠边停车",
      "以上全部都是"
    ],
    "correct": 3
  },
  {
    "q": "当汽车驶向陡坡时（下坡），最安全的方法是：",
    "options": [
      "用低档行驶以及利用机械制动帮助刹车",
      "将汽车熄火",
      "松开离合器使车辆滑行",
      "用空挡行驶"
    ],
    "correct": 0
  },
  {
    "q": "自行车，摩托车等低速非机动车辆行驶在公路上，可以占用的空间：",
    "options": [
      "只能自身体积大小的空间",
      "半个车道",
      "一部车辆的空间",
      "一条道路的空间"
    ],
    "correct": 3
  }
];
