export type Question = {
  q: string;
  options: string[];
  correct: number;
};

export const QUESTIONS: Question[] = [
  {
    "q": "当你到达十字路口而看到黄色的闪灯时，你一定要：",
    "options": [
      "停，如果你想转右",
      "保持同样的速度行驶",
      "停车，如果你想转左",
      "慢驶，然后小心前进"
    ],
    "correct": 3
  },
  {
    "q": "当你在变线行车路上驾驶，听到紧急信号的车，法律上要求你怎样做？",
    "options": [
      "加速，尽快离开",
      "打灯号，让驾驶者超越",
      "尽快驶向路的最右方停下",
      "保持同一速度行驶"
    ],
    "correct": 2
  },
  {
    "q": "当需要车头灯时，在什么情况下开低灯？",
    "options": [
      "与最接近你的车辆相距一公里（0.6哩）内",
      "与最接近你的车辆相距150公尺（500呎）内",
      "与最接近你的车辆相距300公尺（1000呎）内",
      "这是为安全而设，并不是法律规定"
    ],
    "correct": 1
  },
  {
    "q": "当你驶近“停牌”时，你应：",
    "options": [
      "慢驶，鸣笛然后前进",
      "慢驶，当安全才继续前进",
      "停车，鸣笛然后前进",
      "停车，当安全才前进"
    ],
    "correct": 3
  },
  {
    "q": "除非有标志指明，不然在城市、市镇、乡村或发展区内最高的驾驶速度应是：",
    "options": [
      "每小时30公里（20哩）",
      "每小时50公里（30哩）",
      "每小时40公里（25哩）",
      "每小时60公里（35哩）"
    ],
    "correct": 1
  },
  {
    "q": "当亮红灯时，你想驶过十字路口，你一定要：",
    "options": [
      "停车，让行人有优先权，然后小心前进",
      "停车，当交通安全才前进",
      "慢驶，交通安全才前进",
      "停车，直至灯号转绿色，同时安全才前进"
    ],
    "correct": 3
  },
  {
    "q": "当驶入高速公路时，你应该：",
    "options": [
      "停在加速线，看准有安全的位置才尽快驶入高速公路",
      "加速达到高速公路的速度，然后驶入公路交通中",
      "慢车，然后用直角方向驶入高速公路",
      "慢驶，随时准备停下来应付公路的交通"
    ],
    "correct": 1
  },
  {
    "q": "在公路，驾驶者不准在其汽车所拖的露营车或拖船上载有：",
    "options": [
      "枪械",
      "容易燃烧原料",
      "人（乘客）",
      "家畜"
    ],
    "correct": 2
  },
  {
    "q": "在双程路上，你想转左之前，你应在什么位置？",
    "options": [
      "靠近路的右手边",
      "靠近路的左手边",
      "尽量在最接近中线的右边行车路上",
      "没有关系，只要打灯号便可"
    ],
    "correct": 2
  },
  {
    "q": "在十字路口亮绿灯时，以下谁最有优先权？",
    "options": [
      "行人不守灯号过马路",
      "行人遵守灯号过马路",
      "正在转右的车辆",
      "正在转左的车辆"
    ],
    "correct": 1
  },
  {
    "q": "在单程路上你想转左之前，你应在路的什么位置？",
    "options": [
      "靠近路的右手边",
      "靠近路的中线",
      "靠近路的左手边",
      "不成问题，只要你打讯号"
    ],
    "correct": 2
  },
  {
    "q": "当电车停下让乘客上落，当时没有安全岛，你想驶过电车时，法律上要你怎样做？",
    "options": [
      "停在电车后面，然后前进",
      "响号，同时小心驶过",
      "由左边驶过，当交通安全",
      "在电车后门2公尺（6呎）之后停车，让乘客上落，直至安全才驶过"
    ],
    "correct": 3
  },
  {
    "q": "在十字路口闪着红灯，表示：",
    "options": [
      "慢驶，然后加倍小心驾驶",
      "慢驶，如有需要，让左右迎面的车辆有优先权",
      "灯号坏了，小心前进",
      "停车，直至安全才前进"
    ],
    "correct": 3
  },
  {
    "q": "当红灯可以转右时，在未驶入十字路口前，法律上你应怎么做？",
    "options": [
      "慢驶，小心前进",
      "停车，然后侧侧地进入交通中",
      "停车，打灯号，当不阻碍别地车辆及行人才转弯",
      "慢驶，打讯号及转弯"
    ],
    "correct": 2
  },
  {
    "q": "当你想转右时，你应驶在路的哪一条线？",
    "options": [
      "靠近路的左边",
      "靠近路的右边",
      "靠近路的中线",
      "不成问题，打灯便可"
    ],
    "correct": 1
  },
  {
    "q": "当到达十字路口，绿灯刚转黄灯，你应怎样做？",
    "options": [
      "停车，如果停车是危险的，前进要加倍小心",
      "加速，并尽快驶过十字路口",
      "继续驶过十字路口，不用慢驶或停下来",
      "响号，并警告行人和别的驾驶者，使他们知道你不会停车"
    ],
    "correct": 0
  },
  {
    "q": "某人的驾驶执照被吊销后他",
    "options": [
      "在非常紧急时，可以驾驶",
      "返工及放工时才准驾驶",
      "在有车牌的人陪同下才可驾驶",
      "在任何情况下都不准驾驶"
    ],
    "correct": 3
  },
  {
    "q": "在安大略省，是有安全带法例",
    "options": [
      "对",
      "不对",
      "只是在公路上驾驶时",
      "只是在市区内驾驶时"
    ],
    "correct": 0
  },
  {
    "q": "当两架车在大约同一时间驶到没有标志的十字路口，哪一架车有优先权？",
    "options": [
      "从左方驶来的车辆",
      "从右方驶来的车辆",
      "两者都不是",
      "驶得较快的车辆"
    ],
    "correct": 1
  },
  {
    "q": "在安全的情况下，可从别的车辆右方超越：",
    "options": [
      "任何街道及公路都准许",
      "如果可能在路旁驶过是准许的",
      "无论在什么情况下都不准许",
      "是准许的，当街道及公路有两条或以上同一方向的行车线"
    ],
    "correct": 3
  },
  {
    "q": "法律上，在什么时候需要把车头灯开着？",
    "options": [
      "在日落和日出时",
      "在黄昏及黎明之间和在任何时间150公尺（500呎）内看不清时",
      "在日落前半小时，在日出后半小时及任何时间在150公尺（500呎）内看不清事物时",
      "没有特别时间规定"
    ],
    "correct": 2
  },
  {
    "q": "驾驶者是否要负责车上乘客扣上安全带呢？",
    "options": [
      "只是乘客在十六岁以上",
      "只是乘客在五岁至十六岁",
      "只是乘客在前面的座位",
      "只是乘客在十八岁以上"
    ],
    "correct": 1
  },
  {
    "q": "当需要开车头灯时，驾驶者必要用低灯，当跟在别的车后面",
    "options": [
      "30公尺（100呎）内",
      "60公尺（200呎）内",
      "120公尺（400呎）内",
      "只是当接近其他车辆时"
    ],
    "correct": 1
  },
  {
    "q": "当驶近“让牌”时，在法例上你应怎样做？",
    "options": [
      "慢下，如有需要时停下及让路于有优先权者先行",
      "停，然后慢驶入交通中",
      "停，然后快速驶入交通中",
      "加速，并挤迫入交通中"
    ],
    "correct": 0
  },
  {
    "q": "酒精在人体血液中占什么份量，使你成为危险驾驶者及有罪?",
    "options": [
      "0.03%",
      "0.05%",
      "0.08%",
      "1.0%"
    ],
    "correct": 2
  },
  {
    "q": "在十字路口，亮红灯并有绿色箭头表示：",
    "options": [
      "停，先等候绿灯，然后向绿色箭头的方向转",
      "小心向着箭头的方向转，让路于有优先权的车辆及行人",
      "停车，然后前进",
      "绿色箭头只是给行人的讯号"
    ],
    "correct": 1
  },
  {
    "q": "一定要报警的交通意外是当有人受伤或损失超过",
    "options": [
      "一百元",
      "一百五十元",
      "二百元",
      "一千元"
    ],
    "correct": 3
  },
  {
    "q": "在十字路口，转左及转右都准许时，绿色闪灯表示：",
    "options": [
      "路上安全，你可转左",
      "路上安全，你可转右",
      "路上安全，你可直驶",
      "你可做任何以上的"
    ],
    "correct": 3
  },
  {
    "q": "如果交通灯转了，而行人仍然在过马路，以下谁有优先权",
    "options": [
      "驾驶者正在转弯",
      "行人",
      "驾驶者从右面驶来",
      "驾驶者从左面驶来"
    ],
    "correct": 1
  },
  {
    "q": "如果你被控醉酒行车，第一次会被罚停牌多久？",
    "options": [
      "一个月",
      "三个月",
      "六个月",
      "一年"
    ],
    "correct": 3
  },
  {
    "q": "在车上装有蓝色闪灯是表示：",
    "options": [
      "车内装有爆炸品",
      "铲雪的车辆",
      "救伤车",
      "有紧急事的警车"
    ],
    "correct": 1
  },
  {
    "q": "如果你置身于交通意外，而当时有人受伤，你一定要：",
    "options": [
      "立即报告意外于最近的省警察或当地警察",
      "在四十八小时内报告意外于最近的省警察或当地警察",
      "只是报告意外向你的保险公司",
      "只是报告意外事件给交通部"
    ],
    "correct": 0
  },
  {
    "q": "在离开城市，镇或乡村的高速公路同一方向行驶，除超越外，跟在商业汽车后面应保持什么距离？",
    "options": [
      "30公尺（100呎）",
      "60公尺（200呎）",
      "120公尺（400呎）",
      "150公尺（500呎）"
    ],
    "correct": 1
  },
  {
    "q": "持有驾驶执照而需要转姓名或地址，他需要在什么时间内通知交通部？",
    "options": [
      "六天之内",
      "十五天之内",
      "三十天之内",
      "在换新牌前任何时间都可"
    ],
    "correct": 0
  },
  {
    "q": "如果你置身在一件交通意外，而一定要报警，在什么时间内，你要报告给最近你的省警察或当地警察?",
    "options": [
      "立刻",
      "在二十四小时之内",
      "在四十八小时之内",
      "在七十二小时内"
    ],
    "correct": 0
  },
  {
    "q": "当货车在高速公路上不能开动时，照明器或反光器一定要放在货车的前面或后面多远呢？",
    "options": [
      "15公尺（50呎）",
      "30公尺（100呎）",
      "40公尺（200呎）",
      "90公尺（300呎）"
    ],
    "correct": 1
  },
  {
    "q": "以下什么情形下“u”转是危险和不合法的：",
    "options": [
      "在弯路或在斜坡，视力从两方向150公尺（500呎）内看不清楚时",
      "在火车路上或火车路30公尺（100呎）之内",
      "在桥、高架公路或隧道中150公尺（500呎）内，视力受阻碍时",
      "以上所有的情形都包括在内"
    ],
    "correct": 3
  },
  {
    "q": "驾驶者被停牌，而被控再次驾驶，他应受什么责罚？",
    "options": [
      "罚款五百元或入狱六个月或两样都罚",
      "将汽车扣留三个月",
      "再加多六个月不准驾驶的权利",
      "以上任何一点或全部"
    ],
    "correct": 3
  },
  {
    "q": "当驶近火车路时，看到有电动式的机械讯号或有人拿着旗号警告有火车来时，你应：",
    "options": [
      "停车在距离路轨最少1.5公尺（5呎）",
      "加速尽快驶过火车路",
      "停车在距离路轨最少5公尺（15呎）",
      "慢驶，小心前进"
    ],
    "correct": 2
  },
  {
    "q": "如果车主没有买汽车保险，他有什么保障？",
    "options": [
      "一万元保险赔偿",
      "二万元保险赔偿",
      "三万五千元保险赔偿",
      "全无保险赔偿"
    ],
    "correct": 3
  },
  {
    "q": "在什么情形下，驾驶执照会被取消？",
    "options": [
      "没有去重考",
      "持有改过的执照",
      "重考而不合格",
      "以上任何情形或全部都是"
    ],
    "correct": 3
  },
  {
    "q": "警察有权要求车主拿出什么文件：",
    "options": [
      "如汽车有买保险——保险纸",
      "汽车车主证",
      "如只是汽车驾驶者——有效驾驶执照",
      "以上任何一项都是"
    ],
    "correct": 3
  },
  {
    "q": "在什么情形下可将驾驶执照借给他人？",
    "options": [
      "永远不能",
      "可以借给正在学车者",
      "只可作表明身份用",
      "在紧急时"
    ],
    "correct": 0
  },
  {
    "q": "当你驶近十字路口，正亮着红色交通灯，而警察打手势指挥你通过，你应：",
    "options": [
      "等候绿灯",
      "服从警察的指挥，立即通过",
      "让警察知道当时亮着红灯",
      "停下来，确定他要你通过"
    ],
    "correct": 1
  },
  {
    "q": "驾驶者犯上开快车，比限制时速超过五十公里（三十哩）或以上时，法庭会将怎样处罚呢？",
    "options": [
      "停牌六个月",
      "停牌三十天",
      "扣留汽车六个月",
      "驾驶者入狱六个月"
    ],
    "correct": 1
  },
  {
    "q": "当你接近十字路口时，发觉十字路口前面交通很挤迫，你应：",
    "options": [
      "贴着前面的车辆行驶",
      "慢慢驶入十字路口，直至前面交通畅通后才前进",
      "停在十字路口之前，等待前面交通畅通后才前进",
      "响号警告前面车辆前进"
    ],
    "correct": 2
  },
  {
    "q": "一辆“校车”闪红灯停在中间没有栏杆或障碍物的高速公路中，无论你是迎面而来或从后面超越，法律要求你：",
    "options": [
      "没有关系，只要你响号",
      "停车，直至校车前进或红灯已不再闪",
      "等待接近的车辆驶过",
      "减低速度，同时小心驶过"
    ],
    "correct": 1
  },
  {
    "q": "驾驶人可能需要被接见问话或重考驾驶技术：",
    "options": [
      "当驾驶过失而被记下的分数达到九点",
      "当驾驶过失而被记下的分数达到三点",
      "当驾驶过失而被记下的分数达到六点",
      "当驾驶过失而被记下的分数达到十五点"
    ],
    "correct": 0
  },
  {
    "q": "当驾驶过失达到九点时，被接见问话后，交通部可能暂停驾驶人执照：",
    "options": [
      "当驾驶人不能提出充分的理由反对停用执照",
      "当驾驶人没有五年的驾驶经验",
      "如驾驶人的执照不是作商业用途",
      "驾驶过失除非达到十五点交通部时不能暂停执照的"
    ],
    "correct": 0
  },
  {
    "q": "当驾驶人的过失记录达到十五点或以上时，执照将受暂停：",
    "options": [
      "自动停牌，从退回执照起停牌三十天",
      "由交通部再审查",
      "如执照不是作商业用途",
      "三个月"
    ],
    "correct": 0
  },
  {
    "q": "当过失点达到十五分时，牌照要吊销三十天恢复驾驶后的分数，将会",
    "options": [
      "减到七分",
      "减到零分",
      "减到五分",
      "以上全不是"
    ],
    "correct": 0
  },
  {
    "q": "卖汽车给别人，卖车者应该：",
    "options": [
      "在卖车后六日内通知交通部及改车主姓名",
      "和买车者到换牌处登记更换新车主姓名",
      "如汽车没有“安全合格证”应交还车牌及车证给换牌处，而用卖车者的名下取得“汽车未合格证”",
      "以上所有情形都是"
    ],
    "correct": 3
  },
  {
    "q": "你应保持一种速度行车，无论在任何情况下，你也能：",
    "options": [
      "在90公尺（300呎）内停车",
      "在60公尺（200呎）内停车",
      "在一个安全距离内停车",
      "在150公尺（500呎）内停车"
    ],
    "correct": 2
  },
  {
    "q": "不能随时换线除非先：",
    "options": [
      "发出正确灯号及肯定安全才能转线",
      "减慢速度及打出正确灯号",
      "只看倒后镜",
      "响喇叭及望后面"
    ],
    "correct": 0
  },
  {
    "q": "法律规定泊车距离救火喉多远才是合法的：",
    "options": [
      "3公尺（10呎）",
      "4.5公尺（15呎）",
      "1.5公尺（5呎）",
      "6公尺（20呎）"
    ],
    "correct": 0
  },
  {
    "q": "大多数汽车滑胎的原因是：",
    "options": [
      "车胎汽不够",
      "车胎太多汽",
      "路上有雪或冰",
      "驾驶速度太快"
    ],
    "correct": 3
  },
  {
    "q": "在什么时候可用泊车灯？",
    "options": [
      "什么时候都可以用",
      "在泊车时用",
      "在大雾中驾驶时用",
      "在光线充足的街道上驾驶时用"
    ],
    "correct": 1
  },
  {
    "q": "在湿滑或结冰的路上快速停车的最好方法是：",
    "options": [
      "在脚制上一踏一放的方法，直至车辆完全停下来",
      "把脚离开脚制，使车自动停下",
      "大力踏在脚制上，预防车辆滑行",
      "像你平时一样方法踏脚制"
    ],
    "correct": 0
  },
  {
    "q": "在大雾中行驶，你应用：",
    "options": [
      "泊车灯",
      "低灯",
      "泊车灯及高灯",
      "高灯"
    ],
    "correct": 1
  },
  {
    "q": "当你泊车在向下的斜坡在你离开车之前，你应：",
    "options": [
      "扭直前胎与路边平行",
      "扭前胎向左，并拉紧手掣",
      "只是拉紧手掣",
      "扭前胎向右，并拉紧手掣"
    ],
    "correct": 3
  },
  {
    "q": "当你知道另一辆车准备驶过或超越时，你应：",
    "options": [
      "驶向路的右边，让他超越",
      "加速使他不能超越",
      "打灯号暗示他不要超越",
      "驶向左边，阻止他超越"
    ],
    "correct": 0
  },
  {
    "q": "当你右边车胎驶入路边泥地，哪一个是最好的方法让车驶回路面：",
    "options": [
      "大力把方向盘扭去左边",
      "踏脚制并大力把方向盘扭去左边",
      "脚离开油门，让车辆慢下来时才驶回路面",
      "踏脚制以减慢速度"
    ],
    "correct": 2
  },
  {
    "q": "当你驾驶每小时50公里（30哩）应该和前面车辆最少保持多远才安全：",
    "options": [
      "七个车位的距离",
      "三个车位的距离",
      "一个车位的距离",
      "五个车位的距离"
    ],
    "correct": 1
  },
  {
    "q": "除非有特别标志，负责在城市镇、乡村或发展区以外的公路，最高的驾驶速度是：",
    "options": [
      "每小时100公里（60哩）",
      "每小时80公里（50哩）",
      "每小时60公里（40哩）",
      "每小时50公里（30哩）"
    ],
    "correct": 1
  },
  {
    "q": "当你把车驶出停车位前，你应：",
    "options": [
      "看交通情形，打灯号及立即驶离路边",
      "响号然后慢慢从路边驶出",
      "看清楚交通情形，打灯号，当安全的时候才从路边驶出",
      "打灯号，然后驶出路边"
    ],
    "correct": 2
  },
  {
    "q": "当汽车驶下斜坡时，最安全的方法是：",
    "options": [
      "用低波行驶及利用机器帮助煞掣",
      "扭熄汽车机器",
      "用中波行驶",
      "解脱汽车离合器，使车溜下"
    ],
    "correct": 0
  },
  {
    "q": "夜间在快速公路行驶时，你必须用低灯，当你：",
    "options": [
      "接近十字路口",
      "遇到迎面有车来或跟在别的车辆后时",
      "当其他车辆用低灯",
      "遇到迎面车辆的车头灯，使你看不清楚"
    ],
    "correct": 1
  },
  {
    "q": "在夜间以最高限制速度行驶比日间更危险，因为：",
    "options": [
      "一些非法驾驶者只用泊车灯行驶",
      "在夜间，你不能看得前面很远",
      "在夜间，路面更用以湿滑",
      "你的反应在夜间会较慢"
    ],
    "correct": 1
  },
  {
    "q": "以下哪一种手势讯号是表示慢驶或停车？",
    "options": [
      "手臂伸出向上",
      "手臂伸直向窗外",
      "手臂伸出向下",
      "转圆圈的动作"
    ],
    "correct": 2
  },
  {
    "q": "在夜间行驶，当你遇到迎面车辆车灯很强烈耀眼，使你看不清楚，最安全的方法是：",
    "options": [
      "迅速的将眼睛一张一合",
      "看着迎面车辆的车头灯",
      "把车灯转用高灯",
      "把视线稍为望向路的右手边"
    ],
    "correct": 3
  },
  {
    "q": "当车辆停下来让行人过斑马线时，你应：",
    "options": [
      "从左面超越停下的车",
      "响号指挥停车的驾驶者向前行驶",
      "从右面超越停下的车",
      "不能超越任何停下来让行人过马路的车辆"
    ],
    "correct": 3
  },
  {
    "q": "路的中间有断续的线是代表：",
    "options": [
      "不能超越",
      "可以超越，当交通安全时",
      "随时可以超越",
      "在日间才可以超越"
    ],
    "correct": 1
  },
  {
    "q": "除非你打算扒过及超越另一辆车，或想转左，否则你应：",
    "options": [
      "驾驶在路的中间",
      "时时靠路的右面行驶",
      "在公路的沙地上行驶",
      "时时靠路的左边行驶"
    ],
    "correct": 1
  },
  {
    "q": "当你决定“U转”与否之前，你首先应查看：",
    "options": [
      "交通规则",
      "有没有树，救火喉，或路边灯柱",
      "你的汽车转弯的范围内",
      "路边的高度"
    ],
    "correct": 0
  },
  {
    "q": "路的中间，有一实线，有一虚线，而你靠近实线，实线的意思是：",
    "options": [
      "扒头或超越是不安全的",
      "没有车辆时才可以超越",
      "扒头及超越是安全的",
      "随时都可以超越"
    ],
    "correct": 0
  },
  {
    "q": "由私家路驶入公路之前，驾驶者应：",
    "options": [
      "响号并小心前进",
      "尽快驶入或横过公路",
      "打手势及取优先权先行",
      "让所有驶近公路的车辆有优先权"
    ],
    "correct": 3
  },
  {
    "q": "当驾驶时你其中一个车胎突然爆胎,你应：",
    "options": [
      "集中注意在方向盘",
      "脚离开油门使车速减慢",
      "使汽车停下在路旁",
      "以上全部都是"
    ],
    "correct": 3
  },
  {
    "q": "当电车停站让乘客上落,当时是一个安全岛,在法律上你应怎样做：",
    "options": [
      "小心驶过",
      "停在安全岛后最小2公尺",
      "响号小心驶过",
      "在电车的左面驶过"
    ],
    "correct": 0
  },
  {
    "q": "如果你驶近十字路口而交通灯坏了,你应：",
    "options": [
      "让右面交通先行",
      "停,直到无车时才驶过",
      "处理像四面停牌一样",
      "减慢小心驶过"
    ],
    "correct": 2
  },
  {
    "q": "当校巴停下,上落乘客而你驶过会怎样：",
    "options": [
      "监禁一年",
      "扣六分及罚款高达一千元",
      "警告及罚款一百元",
      "重考路试"
    ],
    "correct": 1
  },
  {
    "q": "由定罪那天起,过失点停留在你驾驶记录多久：",
    "options": [
      "1年",
      "2年",
      "3年",
      "5年"
    ],
    "correct": 1
  },
  {
    "q": "当你的汽车滑胎时,首先怎样应付：(例如车尾滑向右边)",
    "options": [
      "把方向盘转向相反滑的方向",
      "把方向盘转直走",
      "大力刹停汽车",
      "把方向盘转向滑车的方向"
    ],
    "correct": 3
  },
  {
    "q": "在驾驶时,如果你失控,车胎驶出路旁,你应：",
    "options": [
      "紧握方向盘",
      "脚离开油门使车速放慢,避免重踏脚制",
      "当车得到控制后驶回车路上",
      "以上全部都是"
    ],
    "correct": 3
  },
  {
    "q": "在初两年第一阶段(G1)及第二阶段(G2)驾驶者,如你的过失点在九分或以上,你会停牌多久：",
    "options": [
      "60天",
      "30天",
      "一年",
      "15天"
    ],
    "correct": 0
  },
  {
    "q": "407高速公路是：",
    "options": [
      "安省最长公路",
      "是一条新公路",
      "是一条快速收费公路",
      "快速公路通去美国"
    ],
    "correct": 2
  },
  {
    "q": "第一阶段(G1)及第二阶段(G2)驾驶者,在驾驶时体内酒精量是零,如果被捉,除行事法外,还要停牌多久?：",
    "options": [
      "30天",
      "60天",
      "90天",
      "1年"
    ],
    "correct": 0
  },
  {
    "q": "如果你在驾驶时手提电话响,你应怎样做：",
    "options": [
      "在驾驶中尽快简短地谈话",
      "用电话留言,当车停下时再查口信",
      "如果邻近没有警察就可以谈话",
      "驾驶时是不能用手提电话的"
    ],
    "correct": 1
  },
  {
    "q": "第一阶段(G1)驾驶者,你一定要有一个G牌或以上陪同驾驶,他的驾驶经验在几年以上：",
    "options": [
      "3年",
      "4年",
      "8年",
      "6年"
    ],
    "correct": 1
  },
  {
    "q": "如果你驾驶时因使用手提电话发生意外：",
    "options": [
      "你的保险费增加",
      "你会被控诉,危险驾驶及扣六分",
      "你要停牌一年",
      "你要重考路试"
    ],
    "correct": 1
  },
  {
    "q": "如果你是第二阶段(G2)驾驶者,你要维持酒精含量在：",
    "options": [
      "百分之0.08",
      "百分之0.05",
      "百分之0.03",
      "百分之零"
    ],
    "correct": 3
  },
  {
    "q": "雪胎什么时候用最好：",
    "options": [
      "在夏天驾驶",
      "在四季都可路",
      "在冬天使用",
      "在春天及秋天用"
    ],
    "correct": 2
  },
  {
    "q": "在公路交通法规被停牌,而你是第一次被捉驾驶,刑罚是：",
    "options": [
      "罚款500元",
      "罚款1000到5000元",
      "坐监6个月",
      "以上全部都是"
    ],
    "correct": 1
  },
  {
    "q": "警察有权截查可疑醉酒驾驶者,如你拒绝用酒精测试器,你的车牌会立刻被吊销到：",
    "options": [
      "30天",
      "1年",
      "60天",
      "90天"
    ],
    "correct": 3
  },
  {
    "q": "在两年内第一阶段(G1)及第二阶段(G2)的驾驶者,过失分在9分或以上时,在停牌60天后过失点减到：",
    "options": [
      "6分",
      "4分",
      "0分",
      "2分"
    ],
    "correct": 1
  },
  {
    "q": "如果你的脚制失控：",
    "options": [
      "在脚制上用一踏一放方法",
      "逐渐地拉实手制",
      "手按着手制的按钮上",
      "以上全部都是"
    ],
    "correct": 3
  },
  {
    "q": "第一阶段(G1)的驾驶者,你一定不能喝酒驾驶,而陪同的G牌陪同者酒精要少过：",
    "options": [
      "零度酒精",
      "百分之0.05",
      "百分之0.08",
      "百分之0.03"
    ],
    "correct": 1
  },
  {
    "q": "如果你是\"犯刑事法\"停牌,而被捉驾驶,你的汽车会被扣压多久?：",
    "options": [
      "1年",
      "6个月",
      "45天",
      "30天"
    ],
    "correct": 2
  },
  {
    "q": "如果有一辆车紧跟随你后面,你应怎样呢?：",
    "options": [
      "如果安全时,转去其他行车线",
      "轻微地减慢与前面车辆增远距离",
      "驶近路旁让紧跟随车超越",
      "以上全部都是"
    ],
    "correct": 3
  },
  {
    "q": "如果你想超越一部摩托车,你应：",
    "options": [
      "在超越前响号",
      "在超越前将你的高灯开亮",
      "方法像超越其他车辆",
      "用摩托车的一半行车线"
    ],
    "correct": 2
  },
  {
    "q": "为什么在换线时要查看盲点：",
    "options": [
      "这个运动是对你的颈部好",
      "无论怎样调校,你的镜子总有些盲点",
      "要看看谁是驾驶者",
      "以上全部都是"
    ],
    "correct": 1
  },
  {
    "q": "你如果发生交通意外,在什么情况下一定要报警?：",
    "options": [
      "损失小过六百元",
      "损失超过一千元",
      "如有人受伤或死亡",
      "以上2及3都是对的"
    ],
    "correct": 3
  },
  {
    "q": "如果你是青年驾驶者,刚在6个月内考取G2牌照,在深夜12时到早上5时,你可乘载多少乘客：",
    "options": [
      "3个在19岁或以下的乘客",
      "不能有乘客在19岁或以下",
      "1个在19岁或以下的乘客",
      "2个在19岁或以下的乘客"
    ],
    "correct": 2
  },
  {
    "q": "如果你是青年驾驶者,考取G2牌照超过6个月后,在没有考得G牌或未满20岁时,你可乘载多少乘客在深夜12时到早上5时：",
    "options": [
      "3个在19岁或以下的乘客",
      "不能有乘客在19岁或以下",
      "1个在19岁或以下的乘客",
      "2个在19岁或以下的乘客"
    ],
    "correct": 0
  },
  {
    "q": "青年驾驶者有些例外,如果有一个____年G牌驾驶者坐在前排或其他青年乘客都是他直属家人：",
    "options": [
      "2年",
      "3年",
      "4年",
      "5年"
    ],
    "correct": 2
  },
  {
    "q": "在晚间驾驶,如车速快过你的车头灯所照到的是危险,因为：",
    "options": [
      "你驶车太快",
      "你的车头灯太亮",
      "你看到时,想停也停不下来",
      "这对汽车电池是不好的"
    ],
    "correct": 2
  }
];
